Conf.Simple/src/InformationRegisters/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияМобильныхУстройств</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <enumValues>
    <name>ЗапросПолнойВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДанных</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПолучитьДанные</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_СостоянияМобильныхУстройств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СостоянияМобильныхУстройств(Параметры = Неопределено, ВПривилегированномРежиме = Ложь) Экспорт
	
	Если ВПривилегированномРежиме И Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ВыборПервых = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Первые", 0, Тип("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияМУ.МобильноеУстройство,
		|	СостоянияМУ.ПометкаУдаления,
		|	СостоянияМУ.Состояние
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ " + ?(ВыборПервых > 0, СтрШаблон("ПЕРВЫЕ %1", Формат(ВыборПервых, "ЧДЦ=0; ЧГ=0;")), "") + "
		|		МобильныеУстройства.Ссылка КАК МобильноеУстройство,
		|		МобильныеУстройства.ПометкаУдаления,
		|		ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние = ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияМобильныхУстройств.ПустаяСсылка)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияМобильныхУстройств.Выгружено)
		|			ИНАЧЕ СостоянияМобильныхУстройств.Состояние
		|		КОНЕЦ КАК Состояние
		|	ИЗ
		|		ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО МобильныеУстройства.Ссылка = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		НЕ МобильныеУстройства.ЭтотУзел
		|		И ВЫБОР
		|			КОГДА &МобильноеУстройство = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ МобильныеУстройства.Ссылка = &МобильноеУстройство
		|		КОНЕЦ
		|		И ВЫБОР
		|			КОГДА &ОтборМобильныеУстройстваВСписке
		|				ТОГДА МобильныеУстройства.Ссылка В (&МобильныеУстройства)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|		И ВЫБОР
		|			КОГДА &ВключаяПомеченныеНаУдаление
		|				ТОГДА НЕ МобильныеУстройства.ПометкаУдаления
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК СостоянияМУ
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ОтборСостоянияВСписке
		|			ТОГДА СостоянияМУ.Состояние В (&Состояния)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ОтборИсключитьСостоянияВСписке
		|			ТОГДА НЕ СостоянияМУ.Состояние В (&ИсключитьСостояния)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &Состояние = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СостоянияМУ.Состояние = &Состояние
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ИсключитьСостояние = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СостоянияМУ.Состояние <> &ИсключитьСостояние
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ВключаяПомеченныеНаУдаление", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "ВключаяПомеченныеНаУдаление", Ложь, Тип("Булево")));
	Запрос.УстановитьПараметр("Состояния", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "Состояния", Новый Массив(), Тип("Массив")));
	Запрос.УстановитьПараметр("ИсключитьСостояния", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "ИсключитьСостояния", Новый Массив(), Тип("Массив")));
	Запрос.УстановитьПараметр("МобильныеУстройства", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "МобильныеУстройства", Новый Массив(), Тип("Массив")));
	
	Запрос.УстановитьПараметр("МобильноеУстройство", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "МобильноеУстройство"));
	Запрос.УстановитьПараметр("Состояние", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Состояние"));
	Запрос.УстановитьПараметр("ИсключитьСостояние", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИсключитьСостояние"));
	
	Запрос.УстановитьПараметр("ОтборСостоянияВСписке", (Запрос.Параметры.Состояния.Количество() > 0));
	Запрос.УстановитьПараметр("ОтборИсключитьСостоянияВСписке", (Запрос.Параметры.ИсключитьСостояния.Количество() > 0));
	Запрос.УстановитьПараметр("ОтборМобильныеУстройстваВСписке", (Запрос.Параметры.МобильныеУстройства.Количество() > 0));
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ТекущееСостояние(МобильноеУстройство) Экспорт
	
	Состояние = Неопределено;
	
	ПараметрыРезультата = Новый Структура();
	ПараметрыРезультата.Вставить("Первые", 1);
	ПараметрыРезультата.Вставить("МобильноеУстройство", МобильноеУстройство);
	Результат = СостоянияМобильныхУстройств(ПараметрыРезультата, Истина);
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Состояние = Выборка.Состояние;
		
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Процедура СменитьСостояние(МобильноеУстройство, НовоеСостояние = Неопределено, Описание = "") Экспорт
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		Не SUI_МобильныеУстройстваСервер.МобильноеУстройствоФильтр(МобильноеУстройство, Ложь).Пустая(), 
		НСтр("ru = 'Не удалось определить мобильное устройство для смены состояния'"));
		
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.МобильноеУстройство.Установить(МобильноеУстройство);
	
	Запись = НаборЗаписей.Добавить();
	Запись.МобильноеУстройство = МобильноеУстройство;
	Запись.Состояние = НовоеСостояние;
	Запись.Описание = Описание;
	
	Если Не ЗначениеЗаполнено(Запись.Состояние) Тогда
		НаборЗаписей.Удалить(Запись);
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
